{
    "team": {
        "penguins": {
            "1980s": {
                "picture": "pens_1980s.jpg",
                "description": "[FROM Wikipedia] The Penguins began the 1980s by changing their team colors; in January 1980, the team switched from wearing blue and white to their present-day scheme of black and gold to honor Pittsburgh's other sports teams, the Pirates and the Steelers, as well as the Flag of Pittsburgh. Both the Pirates and Steelers had worn black and gold for decades, and both were fresh off world championship seasons at that time. The Bruins protested this color change, claiming a monopoly on black and gold, but the Penguins defended their choice by stating that the NHL Pirates also used black and gold as their team colors and that black and gold were Pittsburgh's traditional sporting colors. The NHL agreed and Pittsburgh was allowed to use black and gold. The Penguins officially debuted wearing black and gold against the St. Louis Blues at the Civic Arena on January 30, 1980. On the ice, the Penguins began the 1980s with defenseman Randy Carlyle, and prolific scorers Paul Gardner and Mike Bullard, but little else. During the early part of the decade, the Penguins made a habit of being a tough draw for higher-seeded opponents in the playoffs. In 1980, the 13th-seeded Penguins took the Bruins to the limit in their first round playoff series. The following season, as the 15th seed, they lost the decisive game of their first-round series in overtime to the heavily favored St. Louis Blues. Then, in the 1982 playoffs, the Penguins held a 3–1 lead late in the fifth and final game of their playoff series against the reigning champions, the New York Islanders. However, the Islanders rallied to force overtime and won the series on a goal by John Tonelli. It would be the Pens' final playoff appearance until 1989."
            },
            "1990s": {
                "picture": "pens_1990s.jpg",
                "description": "[FROM PPG] Things changed for the Penguins during the 1990s. Swiftly. Dramatically. Before then, success meant just qualifying for the Stanley Cup playoffs, and players set the franchise's standard for excellence simply by being chosen to play in the All-Star Game. It didn't matter if they only got in because league rules dictated that each team be represented. But after two-plus decades that were, for the most part, best forgotten -- except by those who are big fans of gut-wrenching defeats, bankruptcy or relocation threats -- the Penguins underwent an extreme makeover during the '90s. They won two Stanley Cups and the only Presidents' Trophy in franchise history and, especially during the first half of the decade, never went more than a couple of shifts without sending at least one future Hall of Famer over the boards. Which made it quite challenging to settle on the 20 members of their Team of the Decade. The intent was not to identify the 12 most talented forwards and six most skilled defensemen, but to assemble a team that follows the rough template of the 2009-10 Penguins: Two lines counted on to drive the offense, a third that's good at both ends and an 'energy line' that blends physicality with responsible defense. The defense pairings are intended to offer a balance of offense and defense. Players were selected on the basis of their performance for the Penguins during the period of 1990-91 through 1999-2000."
            },
            "2000s": {
                "picture": "pens_2000s.jpg",
                "description": "[FROM The Hockey Writers] The 2000s have been an up-and-down decade for the Pittsburgh Penguins. They began the decade with a pair of playoff appearances in 2000 and 2001, capping off a string of 11 straight playoff years.  Then things got significantly worse.  After making the conference final in 2001, the Penguins fell apart.  The team ran into financial difficulties and ended up trading most of their marquee talent.  They missed the playoffs for four consecutive seasons and continued to struggle with money woes. In 2007, filled with a line-up of young stars, they returned to the playoffs.  Despite losing to Ottawa in the first round, the team was definitely on the rise.  They lost in the 2008 Stanley Cup Final to Detroit, but won the Stanley Cup in 2009."
            }
        },
        "steelers": {
            "1980s": {
                "picture": "steelers_1980s.jpg",
                "description": "[FROM Steelers.com] As the 1980s opened the Steelers stumbled, failing to make the playoffs in 1980 and 1981 with records of 9-7 and 8-8. In 1982 the Steelers celebrated the team’s 50th anniversary by qualifying for the playoffs with a 6-3 finish in a strike-interrupted season. During the season an anniversary banquet was held to commemorate the team’s first 50 seasons and to honor the Steelers’ all-time team as selected by fan voting. Thousands of fans were attracted to Pittsburgh for a week of activities and exhibits before the anniversary season was ended by San Diego’s 31-28 win in the playoffs. This would be the last playoff game at Three Rivers until the 1992 season, a span of 10 years. The 1983 Steelers won their eighth division title with a 10-6 record, but fell in the postseason, 38-10, to the Los Angeles Raiders. The following year the Steelers won their ninth division crown and the team advanced to the AFC Championship Game with a 24-17 playoff win at Denver. A 45-28 loss to Miami in the AFC Championship game prevented the Steelers from a fifth Super Bowl appearance. The Steelers’ streak of 13 consecutive non-losing seasons came to an end in 1985 with a 7-9 finish, followed by a 6-10 record in 1986. Playoff hopes remained alive in 1987 until the Steelers lost their last two games to finish 8-7 during the strike-shortened season. In 1988 the team suffered through its worst campaign in 19 years with a 5-11 record. The next season got off to a similar start with losses of 51-0 and 41-10 in the first two games as the offense failed to score in the first month of the season. But the young team fought back to finish 9-7 and earn a wild card playoff berth on the season’s final weekend. An exciting 26-23 overtime playoff win in Houston was followed by a heartbreaking 24-23 divisional playoff loss at Denver in which the Steelers led until the final minutes."
            },
            "1990s": {
                "picture": "steelers_1990s.jpg",
                "description": "[FROM Steelers.com] A 9-7 finish in 1990 left the Steelers in a three-way tie for the AFC Central lead, but they were eliminated from playoff contention by a 2-4 division record. The 1991 team finished second in the division despite a 7-9 record, winning the last two games under Noll at home against the Cincinnati Bengals and Cleveland Browns.On December 26, 1991 Chuck Noll announced his retirement from football after 39 consecutive seasons, the last 23 as the Steelers’ head coach, which made him one of only four men to coach the same team for 23 consecutive years. He left as the fifth-winningest coach in NFL history with an overall record of 209-156-1, and as the only coach to win four Super Bowls. Noll was rewarded in 1993 with his election to the Hall of Fame in his first year of eligibility. A new era began in 1992 with the retirement of Noll and the arrival of 34-year-old Bill Cowher, the National Football League’s youngest head coach at the time he assumed control. In the first season of the new era, the Steelers won the AFC Central division crown for the first time since 1984 with an 11-5 record. While the team enjoyed new-found success, Cowher was recognized by the Associated Press as the NFL’s Coach of the Year and six Steelers played in the Pro Bowl, the most in more than a decade.Under Cowher the Steelers became the first AFC team since the 1970 merger to claim its 10th division title. Their 11-5 record equaled the best in the conference and gave the Steelers home field advantage throughout the playoffs. However, in the first postseason game at Three Rivers in exactly 10 years, the Steelers were defeated by eventual AFC champion Buffalo, 24-3.In 1993, the Steelers earned a wild card playoff berth, marking their first consecutive playoff appearances since the 1983-84 seasons. A 9-7 record was good for second place in the division, but the season ended in a 27-24 overtime loss at Kansas City in the AFC Wild Card game.The 1994 Steelers won seven of their final eight regular-season games for their strongest finish since 1978. They captured their second division title in three years with an AFC-best 12-4 record. After a 29-9 victory over the Cleveland Browns in the first round of the playoffs, Pittsburgh hosted it’s first AFC Championship game since 1979. The game went down to the wire and the Steelers lost to the San Diego Chargers, 17-13.At 38, Bill Cowher became the youngest head coach to lead his team to a Super Bowl in 1995. Along the way, Cowher’s team captured their third AFC Central division title in four years, made their fourth straight playoff appearance and won the Steelers’ first AFC title since 1979. After a first-round bye, they defeated the Buffalo Bills (40-21) and the Indianapolis Colts (20-16), before losing to the Dallas Cowboys, 27-17, in Super Bowl XXX in Tempe, Ariz.In 1996, the Steelers finished 10-6 and earned their fifth consecutive trip to the playoffs. Cowher ended the season with 57 career victories, ranking him as the second winningest coach in team history, behind his predecessor Noll.The Steelers captured their fourth consecutive AFC Central title in 1997 while posting an 11-5 record. They were one play away from earning their sixth Super Bowl appearance but lost to Denver, 24-21, in the AFC Championship game. In 1998, the Steelers finished a disappointing 7-9, losing their last five regular-season games and missing the playoffs for the first time under Bill Cowher. The Steelers suffered their second consecutive losing season in 1999, when their record fell to 6-10."
            },
            "2000s": {
                "picture": "steelers_2000s.png",
                "description": "[FROM Steelers.com] After starting the 2000 season with a 0-3 record, the Steelers rebounded to finish the year at 9-7, and barely missed the playoffs.However, 2000 will be remembered most for being the final season for the Steelers at Three Rivers Stadium. The Steelers were 4-4 during their final season at Three Rivers Stadium, including victories in four of their final six home games. The Steelers won their final game at Three Rivers, 24-3, against the Washington Redskins on Dec. 16.The Steelers finished 31 seasons at Three Rivers Stadium (1970-2000) with a 182-73 home record, including the postseason. The Steelers recorded their largest regular- season home attendance figures (440,428) since 1998 in the final season, including a season-high 58,183 fans during the final game in stadium history.The Steelers began a new era in team history in 2001 with the opening of their new stadium, Heinz Field. The Steelers posted an AFC-best 13-3 regular-season record, including a 7-1 mark at home, and advanced to the AFC Championship Game. The inaugural game at Heinz Field was originally scheduled to be a nationally televised Sunday Night game on Sept. 16. However, the September 11 terrorist attacks on America forced the NFL to postpone all games that weekend — which were eventually rescheduled for the end of the season. As a result, the Steelers opened Heinz Field on Sunday, Oct. 7 with a 16-7 win against the Cincinnati Bengals.The Steelers defeated the defending Super Bowl Champion Baltimore Ravens, 27-10, in the AFC Divisional Playoffs, in the first-ever postseason game played at Heinz Field. However, they suffered a disappointing 24-17 loss at home in the AFC Championship Game to the eventual Super Bowl-champion New England Patriots.After a 0-2 start in 2002, the Steelers rallied to make the playoffs for the second consecutive season. However, the team’s Super Bowl hopes ended when they lost, 34-31, in overtime to the Tennessee Titans on the road.The Steelers began the 2003 season with a 34-15 victory against AFC North rival Baltimore Ravens. However, the team never regained that magic and finished the season with a 6-10 record and missed the playoffs for the first time in three years.The Steelers set a team record in 2004 by becoming the first AFC team to win 15 games (15-1) in the regular season. They ultimately advanced to the AFC Championship Game where they lost to the New England Patriots, 41-27. Nine Steelers were selected to play in the AFC-NFC Pro Bowl, the team’s most since the 1979 season.Pittsburgh found itself sitting at 7-5 after 12 games in 2005, but it rallied to win its final four regular-season games to earn the AFC’s sixth seed in the playoffs. The Steelers then won an unprecedented three straight road playoff games to gain a berth in Super Bowl XL in Detroit versus the Seattle Seahawks.The Steelers captured their fifth Super Bowl title with a 21-10 victory over the Seahawks as wide receiver Hines Ward was named MVP, finishing with five receptions for 123 yards. Ward also hauled in a game-clinching 43-yard TD pass from Antwaan Randle El on a gadget play midway through the fourth quarter.The 2006 season saw the Bill Cowher era come to an end with the Steelers finishing the season winning six of their final eight games to post an 8-8 record on the year. On January 5, 2006, Bill Cowher resigned as Steelers head coach with a 161-99-1 overall record, second-best in team history."
            }
        },
        "pirates": {
            "1980s": {
                "picture": "pirates_1980s.jpg",
                "description": "[FROM PPG.com] Don't let anyone tell you the Pirates didn't have a wild, champagne-soaked celebration in the 1980s. It's a lie. The players popped the corks late in the 1987 season when they realized they weren't going to finish in last place. The Pirates had a new manager at spring training, 1986: Jim Leyland. It was that kind of decade. No division titles. Three consecutive last-place finishes in 1984-86, including the worst record in baseball in 1985. The near-demise of the franchise. The Pittsburgh drug trials, involving some of the biggest names in the game and, almost unbelievably, the Pirate Parrot. Even Willie Stargell was booed at Three Rivers Stadium. No one who watched Stargell lead the 1979 We-Are-Family Pirates to the world championship could have predicted any of it. The team won six division championships in the 1970s and another World Series in 1971. Sadly, Pittsburgh baseball fans learned nothing lasts forever. At least the Pirates were competitive in the early-1980s. In 1983, they were tied for first place with the Philadelphia Phillies Sept. 17 before losing eight of their final 14 games and finishing second. Few guessed that would be the team's last hurrah of the decade. But the roster was changing dramatically. In 1979, the Pirates were led by Stargell, Dave Parker, Bill Madlock and Phil Garner. By 1985, the stars -- if that's what you want to call them -- were Sixto Lezcano, Steve Kemp, Johnnie LeMaster and Joggin' George Hendrick. Baseball in Pittsburgh almost didn't survive. Teams have had worse years than the 1985 Pirates, but none comes to mind. The club went 57-104. General Manager Harding 'Pete' Peterson was fired in May, Manager Chuck Tanner after the season. Only 735,900 fans came to Three Rivers Stadium. Even when Pittsburgh tried to support the Pirates, it backfired. A crowd of 31,384 turned out for a game against the Chicago Cubs June 30 -- Ballot by Ballpark day. The fans ended up booing the home team during a 9-2 loss. 'I don't believe the people of Pittsburgh want baseball here,' infielder Jim Morrison said that day. 'I think it's time to move on to a town where they appreciate baseball.' Morrison had no idea how close the Pirates would come to leaving. The Galbreath family, long-time owners of the team, had put it up for sale after the 1984 season. The franchise was hemorrhaging money. Finding a local buyer seemed unlikely. It wasn't just the losing. Talk of cocaine abuse in baseball was everywhere in 1985. Several Pirates -- Parker, Dale Berra, Rod Scurry, Lee Mazzilli, Lee Lacy, John Milner -- and other notable major-league players -- Keith Hernandez, Lonnie Smith, Tim Raines -- were called before a Pittsburgh grand jury. Their testimony led to the drug trials, which made national headlines in September 1985. The problem wasn't just with the Pirates and in Pittsburgh, but it was portrayed that way nationally. Testimony revealed that Scurry once went looking for cocaine during the late innings of a Pirates game. Drug dealers frequented the Pirates' clubhouse. Milner bought two grams of cocaine for $200 in the bathroom stalls at Three Rivers Stadium during a Pirates-Houston Astros game in 1980. Even the Pirate Parrot, Kevin Koch, was implicated for buying cocaine and introducing players to a drug dealer. Seven drug dealers pleaded guilty or were convicted of selling cocaine to players. The players paid a price with their reputation. Parker probably cost himself a better shot at the Hall of Fame. Berra's career ended prematurely. Scurry died a cocaine-related death in 1992 at 36. 'It was a sad chapter for the game of baseball, a sad chapter for the city of Pittsburgh and the Pittsburgh organization,' former Pirates President Carl Barger said. That didn't stop Barger, a prominent lawyer, from leading a push to keep the Pirates in town. Rallying behind Mayor Richard Caliguiri, he and other local business leaders put together a consortium of 13 corporations and individuals, including USX, Alcoa, Westinghouse and PPG Industries, that bought the team from the Galbreaths for $22 million on Oct. 2, 1985. The new owners didn't just save the franchise, it started it back on a path toward winning. It hired Syd Thrift, who had been out of baseball for nine years, as general manager. Thrift then hired Jim Leyland as manager. Leyland, a little-known third-base coach for Tony La Russa's Chicago White Sox, had managed 11 years in the minors. Their work in Pittsburgh looked impossible. 'It ain't easy resurrecting the dead,' Thrift said. But resurrect is what he and Leyland did. Former long-time General Manager Joe L. Brown, , started the job by drafting Barry Bonds and trading Madlock to the Los Angeles Dodgers for Sid Bream and R.J. Reynolds. Thrift did his part with three terrific deals. He traded Jose DeLeon to the Chicago White Sox for Bobby Bonilla; Rick Rhoden, Cecilio Guante and Pat Clements to the New York Yankees for Doug Drabek, Brian Fisher and Logan Easley; and, in the topper on April Fool's Day 1987, he traded popular Tony Pena to the St. Louis Cardinals for Andy Van Slyke, Mike LaValliere and Mike Dunne. 'Now, that was a trifecta,' said Thrift, a man of some ego, who once proclaimed, 'If I ever leave Pittsburgh, it will be worse than Gretzky leaving Canada.' The 1986 Pirates lost 98 games, including 17 of 18 to the world champion New York Mets. Mets pitcher Dwight Gooden called the Pirates 'a Mickey Mouse organization' and compared them to a Little League team. It's no wonder the Pirates celebrated in 1987. For much of the summer, they battled the Cubs to avoid last place before putting together a 20-11 record in September. To see the pandemonium in their clubhouse after their 6-4 win against the Phillies Oct. 2 clinched at least fifth place you would have thought they had won the pennant. 'We got kicked around a little. I don't think the city deserved it and I don't think the club deserved it,' Leyland said, tears and champagne rolling down his face. 'It will be nice to not have someone saying all winter that this is a last-place club.' For a long time in 1988, it looked as if people might end up calling the Pirates division champs. They hung with the Mets into late-June when Howard Johnson hit a two-out, two-strike, ninth-inning, game-tying home run off closer Jim Gott before 41,217 fans at Three Rivers Stadium. That eventual 8-7 defeat damaged the Pirates' hopes. Six Mets wins in eight games against them on consecutive weekends in late-July and early-August killed them. They finished second with an 85-75 record. Still, the 1988 Pirates won back the fans. Attendance was a franchise-record 1,866,713. The team announced its first operating profit since 1971. Not all of the crowds were happy, though. Stargell was booed in May when he returned as Tanner's third-base coach with the Atlanta Braves. A planned Willie Stargell Night at Three Rivers Stadium, in honor of his election to the Hall of Fame, had been canceled two weeks earlier. It was leaked to the media that Stargell had wanted a luxury sports car to take part. 'Anyone who knows me knows that wasn't true,' Stargell said. 'I want to apologize to you for the people who booed you,' an emotional Tanner said. 'They didn't deserve to have you. You never should have been a Pirate.' The Pirates couldn't wait for 1989, but their season ended before it really started. Gott blew out his right elbow in the third game April 6. Van Slyke went on the disabled list April 14 with a rib-cage muscle strain and missed a month. Bream tore up his right knee that same day. LaValliere blew out his left knee April 16. What was left of the Pirates finished in fifth place with a 74-88 record. Their much-anticipated division championship -- the first of three in a row -- would have to wait until 1990."
            },
            "1990s": {
                "picture": "pirates_1990s.png",
                "description": "[FROM Wikipedia] The Pirates were a strong team in the early 1900s, winning National League pennants from 1901–1903 and taking their first World Series title in 1909. They again won the NL in 1925 and 1927 and the World Series in 1925. After a slow period, they returned to dominance and won the 1960 World Series, 1971 World Series and 1979 World Series. They won Eastern Division titles from 1990–1992 but did not return to the postseason again until 2013."
            },
            "2000s": {
                "picture": "pirates_2000s.jpg",
                "description": "[FROM Wikipedia] In 2001, the Pirates opened a new stadium, PNC Park, featuring a simple concept and strategic usage of the Pittsburgh skyline. General manager Dave Littlefield was installed July 13, 2001, midway through the 2001 season, and began overhauling the team to comply with owner Kevin McClatchy's dictum to drastically reduce the payroll. Enigmatic but talented third baseman Aramis Ramírez was traded to the Chicago Cubs in 2003 for a fairly minimal return under pressure to dump his $6 million salary for 2004, and he proceeded to become a star for the Cubs. Brian Giles was one of the National League's best hitters for several years, but he and his $9 million salary were also traded in 2003 to the San Diego Padres for youngsters Óliver Pérez, Jason Bay, and Cory Stewart. Pirate fans found this trade much more palatable in the short run, as Pérez led the majors in strikeouts per inning and Bay won the Rookie of the Year Award in 2004, while Giles put up a subpar season by his standards. After the 2004 season, Jason Kendall went to the Oakland Athletics in a cross-exchange of high-salary players. Illustrating the Pirates' rebuilding efforts, at the close of the 2005 season, the team fielded the youngest roster in baseball, with an average age of 26.6 years. During the course of the season, 14 players were called up from its Triple-A affiliate. On September 6, manager Lloyd McClendon was fired after 5 losing seasons. On October 11, Jim Tracy was hired as the new manager. The 2006 season got off to a slow start with the Pirates losing their first six games. The Bucs stood at an abysmal 30–60 mark by the time they hosted the All Star Game at PNC Park. During the second half of the season, however, the Pirates made a successful turnaround and finished the second half with a 37–35 record. This is the first time the Pirates have finished the second half of the season with a winning record since 1992. Third baseman Freddy Sanchez won the National League batting title for the 2006 season with an average of .344. The 2007 season was a year of transition for the Pirates. Robert Nutting replaced McClatchy as majority owner, becoming the sixth majority owner in Pirates history. On July 6, 2007, Kevin McClatchy announced he was stepping down as the Pirates CEO at the end of the 2007 season. On September 7, 2007, Nutting fired general manager Dave Littlefield."
            }
        }
    }
}