{
    "team": {
        "penguins": {
            "1980s": {
                "picture": "pens_1980s.jpg",
                "description": "[FROM Wikipedia] The Penguins began the 1980s by changing their team colors; in January 1980, the team switched from wearing blue and white to their present-day scheme of black and gold to honor Pittsburgh's other sports teams, the Pirates and the Steelers, as well as the Flag of Pittsburgh. Both the Pirates and Steelers had worn black and gold for decades, and both were fresh off world championship seasons at that time. The Bruins protested this color change, claiming a monopoly on black and gold, but the Penguins defended their choice by stating that the NHL Pirates also used black and gold as their team colors and that black and gold were Pittsburgh's traditional sporting colors. The NHL agreed and Pittsburgh was allowed to use black and gold. The Penguins officially debuted wearing black and gold against the St. Louis Blues at the Civic Arena on January 30, 1980. On the ice, the Penguins began the 1980s with defenseman Randy Carlyle, and prolific scorers Paul Gardner and Mike Bullard, but little else. During the early part of the decade, the Penguins made a habit of being a tough draw for higher-seeded opponents in the playoffs. In 1980, the 13th-seeded Penguins took the Bruins to the limit in their first round playoff series. The following season, as the 15th seed, they lost the decisive game of their first-round series in overtime to the heavily favored St. Louis Blues. Then, in the 1982 playoffs, the Penguins held a 3–1 lead late in the fifth and final game of their playoff series against the reigning champions, the New York Islanders. However, the Islanders rallied to force overtime and won the series on a goal by John Tonelli. It would be the Pens' final playoff appearance until 1989."
            },
            "1990s": {
                "picture": "pens_1990s.png",
                "description": "This is the 1990s history of the Pittsburgh Penguins."
            },
            "2000s": {
                "picture": "pens_2000s.png",
                "description": "This is the 2000s history of the Pittsburgh Penguins."
            }
        },
        "steelers": {
            "1980s": {
                "picture": "steelers_1980s.jpg",
                "description": "This is the 1980s history of the Pittsburgh Steelers."
            },
            "1990s": {
                "picture": "steelers_1990s.png",
                "description": "This is the 1990s history of the Pittsburgh Steelers."
            },
            "2000s": {
                "picture": "steelers_2000s.png",
                "description": "This is the 2000s history of the Pittsburgh Steelers."
            }
        },
        "pirates": {
            "1980s": {
                "picture": "pirates_1980s.jpg",
                "description": "This is the 1980s history of the Pittsburgh Pirates."
            },
            "1990s": {
                "picture": "pirates_1990s.png",
                "description": "This is the 1990s history of the Pittsburgh Pirates."
            },
            "2000s": {
                "picture": "pirates_2000s.png",
                "description": "This is the 2000s history of the Pittsburgh Pirates."
            }
        }
    }
}